In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## 1. Some values in the the FlightNumber column are missing. 
These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [4]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [5]:
newindex = np.arange(1, df['From_To'].count()+1)
df.set_index(newindex, inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN           NaN            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
# Updating the values of Null values in Flight Numbers

for i in np.arange(1, df['From_To'].count()+1):
    if pd.isnull(df['FlightNumber'].loc[i,]):
        df.loc[i, 'FlightNumber'] = df['FlightNumber'].loc[i-1, ] + 10

df['FlightNumber'].astype(int)

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int32

# 2. The From_To column would be better as two separate columns!
Split each string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [7]:
newdf = df.copy()
newdf['From'] = df["From_To"].str.split('_', expand=True)[0]
newdf['To'] = df["From_To"].str.split('_', expand=True)[1]
newdf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
2,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid,miLAN
3,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
4,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,PaRis
5,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

# 3. Notice how the capitalisation of the city names is all mixed up in thistemporary DataFrame. 
Standardise the strings so that only the first letter isuppercase (e.g. "londON" should become "London".)

In [8]:
newdf['From_To'] = newdf['From_To'].str.capitalize()
newdf['From'] = newdf['From'].str.capitalize()
newdf['To'] = newdf['To'].str.capitalize()
newdf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,London_paris,10045.0,"[23, 47]",KLM(!),London,Paris
2,Madrid_milan,10055.0,[],<Air France> (12),Madrid,Milan
3,London_stockholm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
4,Budapest_paris,10075.0,[13],12. Air France,Budapest,Paris
5,Brussels_london,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

# 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [9]:
df.drop('From_To', axis = 1, inplace= True)
df

   FlightNumber  RecentDelays              Airline
1       10045.0      [23, 47]               KLM(!)
2       10055.0            []    <Air France> (12)
3       10065.0  [24, 43, 87]  (British Airways. )
4       10075.0          [13]       12. Air France
5       10085.0      [67, 32]          "Swiss Air"

In [10]:
df['From_To'] = newdf['From_To']
df

   FlightNumber  RecentDelays              Airline           From_To
1       10045.0      [23, 47]               KLM(!)      London_paris
2       10055.0            []    <Air France> (12)      Madrid_milan
3       10065.0  [24, 43, 87]  (British Airways. )  London_stockholm
4       10075.0          [13]       12. Air France    Budapest_paris
5       10085.0      [67, 32]          "Swiss Air"   Brussels_london

# 5. In the RecentDelays column, the values have been entered into theDataFrame as a list. We would like each first value in its own column, eachsecond value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [22]:
rows = []
_ = df.apply(lambda row: [rows.append([row['Airline'], row['FlightNumber'],nn,row['From_To']]) 
                         for nn in row.RecentDelays], axis=1)

In [23]:
rows

[['KLM(!)', 10045.0, 23, 'London_paris'],
 ['KLM(!)', 10045.0, 47, 'London_paris'],
 ['(British Airways. )', 10065.0, 24, 'London_stockholm'],
 ['(British Airways. )', 10065.0, 43, 'London_stockholm'],
 ['(British Airways. )', 10065.0, 87, 'London_stockholm'],
 ['12. Air France', 10075.0, 13, 'Budapest_paris'],
 ['"Swiss Air"', 10085.0, 67, 'Brussels_london'],
 ['"Swiss Air"', 10085.0, 32, 'Brussels_london']]

In [24]:
df_new = pd.DataFrame(rows, columns=df.columns)

In [25]:
print(df_new)

          FlightNumber  RecentDelays  Airline           From_To
0               KLM(!)       10045.0       23      London_paris
1               KLM(!)       10045.0       47      London_paris
2  (British Airways. )       10065.0       24  London_stockholm
3  (British Airways. )       10065.0       43  London_stockholm
4  (British Airways. )       10065.0       87  London_stockholm
5       12. Air France       10075.0       13    Budapest_paris
6          "Swiss Air"       10085.0       67   Brussels_london
7          "Swiss Air"       10085.0       32   Brussels_london

In [26]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [28]:
length_cols = df3.shape[1]

In [29]:
col_list = []
col_dict ={}
for i in range(length_cols):
    Key = df3.columns[i]
    #print(key,i)
    Value = "Delay" + str(i+1)
    col_dict[Key] = Value

In [30]:
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [31]:
df3.rename(columns=col_dict,inplace=True)

In [32]:
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [33]:
df[["Delay1","Delay2","Delay3"]] = df3[["Delay1","Delay2","Delay3"]]

In [34]:
print(df)
print('*'*80)
df.drop('RecentDelays',axis=1,inplace=True)
print(df)

   FlightNumber  RecentDelays              Airline           From_To  Delay1  \
1       10045.0      [23, 47]               KLM(!)      London_paris     NaN
2       10055.0            []    <Air France> (12)      Madrid_milan    24.0
3       10065.0  [24, 43, 87]  (British Airways. )  London_stockholm    13.0
4       10075.0          [13]       12. Air France    Budapest_paris    67.0
5       10085.0      [67, 32]          "Swiss Air"   Brussels_london     NaN

   Delay2  Delay3
1     NaN     NaN
2    43.0    87.0
3     NaN     NaN
4    32.0     NaN
5     NaN     NaN
********************************************************************************
   FlightNumber              Airline           From_To  Delay1  Delay2  Delay3
1       10045.0               KLM(!)      London_paris     NaN     NaN     NaN
2       10055.0    <Air France> (12)      Madrid_milan    24.0    43.0    87.0
3       10065.0  (British Airways. )  London_stockholm    13.0     NaN     NaN
4       10075.0       12. Air France    Budapest_paris    67.0    32.0     NaN
5       10085.0          "Swiss Air"   Brussels_london     NaN     NaN     NaN

In [35]:
df

   FlightNumber              Airline           From_To  Delay1  Delay2  Delay3
1       10045.0               KLM(!)      London_paris     NaN     NaN     NaN
2       10055.0    <Air France> (12)      Madrid_milan    24.0    43.0    87.0
3       10065.0  (British Airways. )  London_stockholm    13.0     NaN     NaN
4       10075.0       12. Air France    Budapest_paris    67.0    32.0     NaN
5       10085.0          "Swiss Air"   Brussels_london     NaN     NaN     NaN